{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "JSON report listing feature evidence mappings between features, source files, components, and tests.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend Tambola feature files.",
  "frontend/DEPLOYMENT.md": "Deployment guide describing prerequisites and steps for building and deploying the frontend.",
  "frontend/index.css": "Empty stylesheet placeholder with no rules defined.",
  "frontend/index.html": "HTML entry point setting up meta tags, favicon, and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component wiring game state, voice settings, auto-draw logic, and layout structure.",
  "frontend/src/features/tambola/components/GameControls.tsx": "Game controls UI providing draw, quick reset, voice toggle, and auto-draw settings with cooldown handling.",
  "frontend/src/features/tambola/components/HistoryPanel.tsx": "Scrollable panel displaying called numbers in reverse order with color-coded tiles.",
  "frontend/src/features/tambola/components/HistorySection.tsx": "Section combining last-number display, auto-draw pause/resume button, and call history panel.",
  "frontend/src/features/tambola/components/HostVoiceManagerDialog.tsx": "Dialog for recording, playing, and deleting host voice clips for numbers 1–90 using IndexedDB storage.",
  "frontend/src/features/tambola/components/LastNumberDisplay.tsx": "Visual card showing the latest drawn number or a placeholder, with completion messaging when all numbers are called.",
  "frontend/src/features/tambola/components/NewGameControl.tsx": "Provides a New Game button with dialogs for incomplete board warnings and confirmation before resetting or starting a new game.",
  "frontend/src/features/tambola/components/NumberBoard.tsx": "Renders a 1–90 grid highlighting numbers that have been called.",
  "frontend/src/features/tambola/components/VerifyCalledNumbers.tsx": "Allows users to enter up to 15 numbers and verifies them against called numbers, showing success or error results.",
  "frontend/src/features/tambola/components/VoiceAnnouncementsPanel.tsx": "Displays controls and status indicators for voice announcements, including TTS initialization and troubleshooting hints.",
  "frontend/src/features/tambola/components/VoiceTroubleshootingHint.tsx": "Shows troubleshooting tips when voice announcements fail, especially in Android wrapper environments.",
  "frontend/src/features/tambola/storage.ts": "Manages saving, loading, and creating initial Tambola game and auto-draw settings in localStorage.",
  "frontend/src/features/tambola/types.ts": "Defines Tambola game state, auto-draw settings, persisted data types, and game action identifiers.",
  "frontend/src/features/tambola/useTambolaGame.ts": "Custom hook handling Tambola game logic including drawing, undoing, resetting, auto-draw control, and persistence.",
  "frontend/src/features/tambola/verify/parseEnteredNumbers.ts": "Empty placeholder file for parsing typed number input.",
  "frontend/src/features/tambola/verify/parseSpokenNumbers.ts": "Parses spoken transcripts into up to 15 unique numbers (1–90) by interpreting digits and number words, including compounds.",
  "frontend/src/features/tambola/voice/tts.ts": "Helpers for loading SpeechSynthesis voices and performing TTS initialization, warm-up, and English voice selection.",
  "frontend/src/features/tambola/voice/types.ts": "Defines voice settings and playback step types for TTS and recorded-number announcements.",
  "frontend/src/features/tambola/voice/useHostVoiceRecorder.ts": "React hook that records microphone audio, stores clips in IndexedDB, and handles recording state and errors.",
  "frontend/src/features/tambola/voice/useSpeechRecognition.ts": "React hook wrapping browser SpeechRecognition to capture transcripts with error handling and state management.",
  "frontend/src/features/tambola/voice/useVoiceAnnouncements.ts": "Controls announcing numbers using TTS and recordings, building step sequences and handling playback and fallbacks.",
  "frontend/src/features/tambola/voice/useVoiceSettings.ts": "React hook managing session-only voice settings including enabled state, reading mode, and source priority.",
  "frontend/src/features/tambola/voice/useWebViewVoiceUnlock.ts": "Initializes WebView-safe audio and TTS by unlocking audio, priming voices, and running a warm-up utterance.",
  "frontend/src/features/tambola/voice/voiceAudio.ts": "Provides audio context unlocking and playback utilities for recorded audio blobs with cleanup and error handling.",
  "frontend/src/features/tambola/voice/voiceClipsStore.ts": "IndexedDB storage helpers for saving, loading, deleting, and listing recorded voice clips for numbers 1–90.",
  "frontend/src/features/tambola/voice/voiceSettingsStorage.ts": "Provides default session-only voice settings and clears any stored settings on startup.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor based on Internet Identity, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, stored identity loading, and state tracking.",
  "frontend/src/index.css": "Defines global Tailwind base styles, color variables, dark mode overrides, and background styling for the app.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/release/liveVersion.ts": "Exports the current live application version and deployment date.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, plugins, animations, and responsive container settings.",
  "project_state.json": "Stores project metadata, versioning, features, and pending feature requests for the voice‑recording app."
}