{
  "backend/main.mo": "Motoko canister storing principals and text values in sets with add and query functions for persistent, remote, and external entries.",
  "feature_evidence.json": "Feature evidence report linking a deployment feature to related files, components, and tests.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short descriptions of their functionality for Tambola features and voice controls.",
  "frontend/DEPLOYMENT.md": "Deployment guide with prerequisites and steps for building and deploying the frontend.",
  "frontend/index.css": "Tailwind base styles defining color tokens, dark mode values, and global CSS variables.",
  "frontend/index.html": "HTML entry point loading the React app with viewport-fit support and favicon setup.",
  "frontend/src/App.tsx": "Main React layout orchestrating game state, voice settings, announcements, and UI panels.",
  "frontend/src/features/tambola/components/GameControls.tsx": "UI controls for drawing numbers, quick reset, and auto‑draw settings with confirmation dialog.",
  "frontend/src/features/tambola/components/HistoryPanel.tsx": "Panel showing called numbers in reverse order with color‑coded recent entries.",
  "frontend/src/features/tambola/components/HostVoiceManagerDialog.tsx": "Dialog for recording, previewing, and deleting host voice clips for numbers 1‑90.",
  "frontend/src/features/tambola/components/LastNumberDisplay.tsx": "Card component showing the most recently drawn number or completion message.",
  "frontend/src/features/tambola/components/NewGameControl.tsx": "Provides a button that opens a confirmation dialog and triggers a new game callback.",
  "frontend/src/features/tambola/components/NumberBoard.tsx": "Displays numbers 1–90 in a grid, highlighting those that have been called.",
  "frontend/src/features/tambola/components/VerifyCalledNumbers.tsx": "Allows users to enter numbers and verifies them against the called numbers list with validation and alerts.",
  "frontend/src/features/tambola/components/VoiceAnnouncementsPanel.tsx": "UI panel for toggling voice announcements, adjusting reading mode, selecting voice priority, and opening voice manager.",
  "frontend/src/features/tambola/storage.ts": "Handles loading, saving, and creating initial tambola game and auto-draw settings in localStorage.",
  "frontend/src/features/tambola/types.ts": "Defines Tambola game state, auto-draw settings, persisted state, and game action types.",
  "frontend/src/features/tambola/useTambolaGame.ts": "Custom hook managing game state, drawing logic, undo, reset, new game, auto-draw settings, and persistence.",
  "frontend/src/features/tambola/verify/parseEnteredNumbers.ts": "Parses user input into unique valid numbers between 1–90, ignoring invalid tokens.",
  "frontend/src/features/tambola/voice/tts.ts": "Utilities for loading browser TTS voices, selecting the best voice, checking availability, and speaking text.",
  "frontend/src/features/tambola/voice/types.ts": "Defines types for reading modes, voice priority, voice settings, and playback steps.",
  "frontend/src/features/tambola/voice/useHostVoiceRecorder.ts": "Hook for recording microphone audio clips for number announcements and saving them.",
  "frontend/src/features/tambola/voice/useVoiceAnnouncements.ts": "Builds and plays a sequence of voice steps for a number using recordings or TTS with fallback handling.",
  "frontend/src/features/tambola/voice/useVoiceSettings.ts": "Manages voice settings state and persists changes to storage.",
  "frontend/src/features/tambola/voice/voiceAudio.ts": "Provides audio context management and helpers for playing and stopping Blob-based audio.",
  "frontend/src/features/tambola/voice/voiceClipsStore.ts": "Stores, loads, lists, and deletes recorded number clips in IndexedDB.",
  "frontend/src/features/tambola/voice/voiceSettingsStorage.ts": "Loads and saves voice settings to localStorage with defaults.",
  "frontend/src/hooks/useActor.ts": "Creates and refreshes a backend actor based on Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, state, and stored identity restoration.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, and global layout and background styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, plugins, and extended utilities.",
  "project_state.json": "Describes project metadata, existing features, and pending feature requests."
}