{
  "backend/main.mo": "Minimal Motoko canister with an empty actor.",
  "feature_evidence.json": "Feature evidence report describing removal of footer version text and listing affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend Tambola feature files.",
  "frontend/DEPLOYMENT.md": "Deployment instructions for building and deploying the Tambola app using Node, pnpm, and dfx.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "HTML entry point setting up metadata, favicon, root div, and loading the React main script.",
  "frontend/src/App.tsx": "Main React app layout combining Tambola game state, controls, history, and voice features without showing a version label.",
  "frontend/src/features/tambola/components/GameControls.tsx": "Draw, reset, and auto‑draw control panel with cooldowns, dialogs, and interval slider.",
  "frontend/src/features/tambola/components/HistoryPanel.tsx": "Scrollable grid showing called numbers in reverse order with highlighted most recent entry.",
  "frontend/src/features/tambola/components/HistorySection.tsx": "Wrapper combining last‑number display and call‑history panel.",
  "frontend/src/features/tambola/components/HostVoiceManagerDialog.tsx": "Management UI for recording, previewing, and deleting host voice clips for numbers 1–90.",
  "frontend/src/features/tambola/components/LastNumberDisplay.tsx": "Card showing the last drawn number or game‑complete state in a large circular display.",
  "frontend/src/features/tambola/components/NewGameControl.tsx": "Renders a button that opens a confirmation dialog and triggers onNewGame when confirmed.",
  "frontend/src/features/tambola/components/NumberBoard.tsx": "Displays a 1–90 grid highlighting called numbers using a styled card layout.",
  "frontend/src/features/tambola/components/VerifyCalledNumbers.tsx": "Provides 15 input fields to verify entered numbers against called numbers and shows success or error results.",
  "frontend/src/features/tambola/components/VoiceAnnouncementsPanel.tsx": "UI panel to toggle voice announcements and configure reading mode, voice priority, and voice manager access.",
  "frontend/src/features/tambola/storage.ts": "Handles localStorage persistence and initialization of game state and auto-draw settings.",
  "frontend/src/features/tambola/types.ts": "Defines types for Tambola game state, auto-draw settings, persisted state, and game actions.",
  "frontend/src/features/tambola/useTambolaGame.ts": "React hook managing game logic, state transitions, auto-draw timers, and persistence.",
  "frontend/src/features/tambola/verify/parseEnteredNumbers.ts": "Parses comma/space‑separated user input into unique valid numbers between 1–90.",
  "frontend/src/features/tambola/verify/parseSpokenNumbers.ts": "Parses spoken transcripts into up to 15 normalized numbers, handling words, digits, and compound forms.",
  "frontend/src/features/tambola/voice/tts.ts": "Provides SpeechSynthesis voice loading, English voice selection, match checking, and text‑to‑speech playback.",
  "frontend/src/features/tambola/voice/types.ts": "Defines types for voice announcement settings, reading modes, priorities, and playback steps.",
  "frontend/src/features/tambola/voice/useHostVoiceRecorder.ts": "Hook providing microphone recording for number announcements and saving audio clips to IndexedDB.",
  "frontend/src/features/tambola/voice/useSpeechRecognition.ts": "Hook wrapping browser SpeechRecognition to capture transcripts with error handling and start/stop controls.",
  "frontend/src/features/tambola/voice/useVoiceAnnouncements.ts": "Controls spoken number announcements by sequencing TTS and recorded clips based on reading mode and priority.",
  "frontend/src/features/tambola/voice/useVoiceSettings.ts": "Manages voice feature settings and persists them via localStorage.",
  "frontend/src/features/tambola/voice/voiceAudio.ts": "Utility for initializing audio context and playing or stopping audio blobs with cleanup.",
  "frontend/src/features/tambola/voice/voiceClipsStore.ts": "IndexedDB store for saving, loading, listing, and deleting recorded number audio clips.",
  "frontend/src/features/tambola/voice/voiceSettingsStorage.ts": "Loads and saves voice settings to localStorage with default fallback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and login/logout via Internet Identity using AuthClient.",
  "frontend/src/index.css": "Tailwind base styles plus theme variables for light/dark modes and background theming.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/src/release/liveVersion.ts": "Defines constants for the current live draft version and its deployment date.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, animations, and plugins for styling the frontend.",
  "project_state.json": "Tracks project state, noting a fix request to remove outdated “Draft 34” text from the footer and listing related feature metadata."
}