{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence describing a version update task affecting liveVersion.ts.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend Tambola feature files.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and build steps.",
  "frontend/index.css": "Tailwind base and custom CSS variables defining light/dark theme colors and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring Tambola game state, voice settings, announcements, and UI layout.",
  "frontend/src/features/tambola/components/GameControls.tsx": "Controls for drawing numbers, quick reset, and auto‑draw with cooldown logic.",
  "frontend/src/features/tambola/components/HistoryPanel.tsx": "Scrollable grid showing reverse‑ordered call history with recent number highlighted.",
  "frontend/src/features/tambola/components/HistorySection.tsx": "Wraps last‑number display and call history panel into a combined section.",
  "frontend/src/features/tambola/components/HostVoiceManagerDialog.tsx": "Dialog for recording, previewing, and deleting custom host voice clips for numbers 1‑90.",
  "frontend/src/features/tambola/components/LastNumberDisplay.tsx": "Card showing the most recent drawn number or game‑complete state.",
  "frontend/src/features/tambola/components/NewGameControl.tsx": "Button that opens a confirmation dialog and triggers onNewGame when confirmed.",
  "frontend/src/features/tambola/components/NumberBoard.tsx": "Displays numbers 1–90 in a grid, highlighting those already called.",
  "frontend/src/features/tambola/components/VerifyCalledNumbers.tsx": "Provides 15 input fields to verify entered numbers against called numbers and shows success or error feedback.",
  "frontend/src/features/tambola/components/VoiceAnnouncementsPanel.tsx": "UI panel to toggle voice announcements, select reading mode, choose voice priority, and open voice manager.",
  "frontend/src/features/tambola/storage.ts": "Handles creation, persistence, and validation of Tambola game and auto‑draw settings using localStorage.",
  "frontend/src/features/tambola/types.ts": "Defines Tambola game state, auto‑draw settings, persisted state, and game action types.",
  "frontend/src/features/tambola/useTambolaGame.ts": "Custom hook managing Tambola gameplay, auto‑draw timers, state persistence, and actions like draw, undo, reset, and new game.",
  "frontend/src/features/tambola/verify/parseEnteredNumbers.ts": "Parses comma/space-separated text into unique valid numbers between 1–90.",
  "frontend/src/features/tambola/verify/parseSpokenNumbers.ts": "Parses spoken transcripts into up to 15 valid numbers, handling number words and compounds.",
  "frontend/src/features/tambola/voice/tts.ts": "Provides browser TTS helpers: loading voices, selecting English voices, and speaking text with SpeechSynthesis.",
  "frontend/src/features/tambola/voice/types.ts": "Defines voice-related types including reading mode, priority, settings, and playback steps.",
  "frontend/src/features/tambola/voice/useHostVoiceRecorder.ts": "Hook to record microphone audio, save it as a clip, and manage recording state and errors.",
  "frontend/src/features/tambola/voice/useSpeechRecognition.ts": "Hook wrapping the browser SpeechRecognition API to capture transcripts and handle listening state and errors.",
  "frontend/src/features/tambola/voice/useVoiceAnnouncements.ts": "Controls number announcements by sequencing TTS and recorded clips based on reading mode and priority.",
  "frontend/src/features/tambola/voice/useVoiceSettings.ts": "Manages voice settings state and persistence updates for reading mode, source priority, and enable toggle.",
  "frontend/src/features/tambola/voice/voiceAudio.ts": "Helpers for initializing audio context and playing or stopping audio blobs with cleanup.",
  "frontend/src/features/tambola/voice/voiceClipsStore.ts": "IndexedDB storage layer for saving, loading, listing, and deleting recorded number voice clips.",
  "frontend/src/features/tambola/voice/voiceSettingsStorage.ts": "Loads and saves voice settings to localStorage with default fallback handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identities, and status tracking.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes, colors, and layout defaults.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/release/liveVersion.ts": "Defines constants for the currently deployed draft version and its release date.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, themes, animations, fonts, plugins, and content paths.",
  "project_state.json": "Stores project state metadata, including versioning, feature requests, and the current draft publish status."
}