{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Lists feature evidence mapping UI changes to affected files and components for several Tambola features.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend Tambola-related source files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark modes with warm color palette.",
  "frontend/index.html": "HTML entry point loading the Tambola app root and main script.",
  "frontend/src/App.tsx": "Main app layout orchestrating New Game, last number, controls, history panel, number board, and undo button.",
  "frontend/src/features/tambola/components/GameControls.tsx": "Control panel with Draw Number, Quick Reset, and auto-draw toggle/interval slider with confirmation dialog.",
  "frontend/src/features/tambola/components/HistoryPanel.tsx": "Displays reverse-ordered list of called numbers inside a scrollable card.",
  "frontend/src/features/tambola/components/LastNumberDisplay.tsx": "Shows the most recently drawn number in a styled circular display or placeholder if none.",
  "frontend/src/features/tambola/components/NewGameControl.tsx": "New Game button with confirmation dialog triggering a full game reset.",
  "frontend/src/features/tambola/components/NumberBoard.tsx": "9x10 grid showing numbers 1–90 with styling highlighting called numbers.",
  "frontend/src/features/tambola/storage.ts": "LocalStorage helpers for loading, saving, and initializing tambola game state and auto‑draw settings.",
  "frontend/src/features/tambola/types.ts": "TypeScript interfaces for tambola game state, auto‑draw settings, and persisted data.",
  "frontend/src/features/tambola/useTambolaGame.ts": "React hook managing Tambola game state with draw, undo, reset, auto‑draw, and persistence logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and handling login/logout flows.",
  "frontend/src/index.css": "Global Tailwind-based styles defining light/dark themes, color variables, and background pattern.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and adding plugins.",
  "project_state.json": "Project metadata describing Tambola app features, requirements, and architectural notes."
}