{
  "backend/main.mo": "Actor stores three sets (principals and text) and provides add/query methods returning principal IDs as text arrays.",
  "feature_evidence.json": "Feature evidence report listing UI feature changes, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend Tambola feature files including state, storage, components, and voice modules.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and steps for building and deploying the Tambola app.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme CSS variables and global background/foreground settings.",
  "frontend/index.html": "HTML entry point defining metadata, favicon, root div, and script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component wiring game state, controls, history section, and voice announcements into a responsive layout.",
  "frontend/src/features/tambola/components/GameControls.tsx": "UI card with draw, reset, and auto‑draw controls including interval slider and confirmation dialog.",
  "frontend/src/features/tambola/components/HistoryPanel.tsx": "Scrollable grid showing reversed call history with latest number highlighted in red.",
  "frontend/src/features/tambola/components/HistorySection.tsx": "Wrapper combining LastNumberDisplay with HistoryPanel to show recent draw and full history.",
  "frontend/src/features/tambola/components/HostVoiceManagerDialog.tsx": "Dialog UI to record, preview, and delete host voice clips for numbers 1–90 with recording and playback state management.",
  "frontend/src/features/tambola/components/LastNumberDisplay.tsx": "Displays the last drawn number or a placeholder, and shows a completion message when all numbers are called.",
  "frontend/src/features/tambola/components/NewGameControl.tsx": "Provides a button and confirmation dialog to start a new Tambola game.",
  "frontend/src/features/tambola/components/NumberBoard.tsx": "Renders a 1–90 grid highlighting numbers that have been called.",
  "frontend/src/features/tambola/components/VerifyCalledNumbers.tsx": "Allows manual or spoken entry of up to 15 numbers and verifies them against called numbers with success or error feedback.",
  "frontend/src/features/tambola/components/VoiceAnnouncementsPanel.tsx": "Panel to configure voice announcements, reading mode, source priority, and open the voice recording manager.",
  "frontend/src/features/tambola/storage.ts": "Handles load/save of persisted game state, and provides initial state creators for game and auto-draw settings.",
  "frontend/src/features/tambola/types.ts": "Defines Tambola game, auto-draw, persisted state structures, and game action types.",
  "frontend/src/features/tambola/useTambolaGame.ts": "Custom hook managing Tambola game logic, draws, undo, auto-draw, new game, reset, and state persistence.",
  "frontend/src/features/tambola/verify/parseEnteredNumbers.ts": "Parses a comma/space‑separated string into unique valid numbers between 1 and 90.",
  "frontend/src/features/tambola/verify/parseSpokenNumbers.ts": "Parses spoken transcripts into up to 15 unique numbers (1-90), handling digits, number words, and compound words.",
  "frontend/src/features/tambola/voice/tts.ts": "Provides SpeechSynthesis-based TTS helpers, selects best matching voice, and exposes voice match status and speech playback.",
  "frontend/src/features/tambola/voice/types.ts": "Defines types for voice settings, reading modes, source priority, and playback steps.",
  "frontend/src/features/tambola/voice/useHostVoiceRecorder.ts": "React hook for recording microphone audio and storing clips in IndexedDB.",
  "frontend/src/features/tambola/voice/useSpeechRecognition.ts": "React hook wrapping browser speech recognition, managing transcript, errors, and start/stop control.",
  "frontend/src/features/tambola/voice/useVoiceAnnouncements.ts": "Controls number announcements using recordings or TTS, building playback sequences based on reading mode.",
  "frontend/src/features/tambola/voice/useVoiceSettings.ts": "Manages voice settings state and persistence, including enable toggle, reading mode, and priority.",
  "frontend/src/features/tambola/voice/voiceAudio.ts": "Handles playback of audio blobs with an AudioContext, including unlocking and stopping audio.",
  "frontend/src/features/tambola/voice/voiceClipsStore.ts": "IndexedDB storage layer for saving, loading, deleting, and listing recorded number clips.",
  "frontend/src/features/tambola/voice/voiceSettingsStorage.ts": "Loads and saves voice settings to localStorage with default fallback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading identities, login, logout, and status tracking.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers, theme variables, dark mode styles, and background theming for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, plugins, animations, and design tokens.",
  "project_state.json": "Describes the project’s current state, features, and pending requests for adding a recent draw number UI box."
}