{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report linking features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text map summarizing frontend file purposes for the Tambola app.",
  "frontend/index.css": "Tailwind base styles and theme variables defining light/dark color palettes and global styling.",
  "frontend/index.html": "HTML entry point loading the Tambola app root and main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app assembling game state, controls, history, and board layout.",
  "frontend/src/features/tambola/components/GameControls.tsx": "UI controls for drawing, undoing, resets with confirmation dialogs, and auto-draw settings.",
  "frontend/src/features/tambola/components/HistoryPanel.tsx": "Displays called numbers in reverse order with scrollable history.",
  "frontend/src/features/tambola/components/LastNumberDisplay.tsx": "Shows the last drawn number in a styled circular display with completion message.",
  "frontend/src/features/tambola/components/NumberBoard.tsx": "Renders numbers 1–90 with visual highlighting for called numbers.",
  "frontend/src/features/tambola/storage.ts": "Functions for loading, saving, and initializing Tambola game state and auto-draw settings.",
  "frontend/src/features/tambola/types.ts": "TypeScript interfaces defining Tambola game state, auto-draw settings, and persisted state.",
  "frontend/src/features/tambola/useTambolaGame.ts": "Custom hook managing Tambola game state, number drawing, undo, auto‑draw timers, and persistence.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, clearing, and status tracking.",
  "frontend/src/index.css": "Tailwind base styles plus custom theme variables and a patterned background for the app.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors from CSS variables, plugins, and layout settings.",
  "project_state.json": "Project metadata describing Tambola app goals, features, architecture notes, and known issues."
}