{
  "kind": "build_request",
  "title": "Add a recent/last draw number box above Call History",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new UI box above the existing \"Call History\" panel that displays the most recent/last drawn Tambola number, updating whenever a new number is drawn.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-14"
        ],
        "quotes": [
          "Perfect now add a box above call history to show the recent / last draw number",
          "Generate code"
        ]
      },
      "acceptanceCriteria": [
        "On all screen sizes, a clearly separated box/card is rendered above the Call History card in the left column (where HistoryPanel currently appears).",
        "When at least one number has been called, the box displays the current last drawn number from the game state.",
        "When no number has been called yet, the box displays a clear placeholder (e.g., \"--\" or \"No number drawn yet\").",
        "The new UI does not introduce horizontal scrolling or layout overflow in the left column and remains responsive on mobile and desktop."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Wire the last/most recent drawn number into the History section by passing the needed state from the main game hook into the History UI (e.g., use gameState.lastDrawn and gameState.isComplete), reusing the existing LastNumberDisplay component where appropriate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "add a box above call history to show the recent / last draw number"
        ]
      },
      "acceptanceCriteria": [
        "The displayed value matches the latest drawn number shown/used elsewhere in the app state (no duplicate or separately stored value).",
        "If the game is complete, the box reflects completion state consistently with the underlying game state (e.g., via isComplete).",
        "No backend changes are required to support this display (purely derived from existing frontend game state)."
      ]
    }
  ],
  "constraints": [
    "Do not perform or require any deployment/publishing actions; only generate code changes.",
    "Do not edit files under frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui)."
  ],
  "nonGoals": [
    "Adding new backend storage or Motoko canister logic for tracking the last drawn number.",
    "Changing unrelated layout areas (Number Board, Game Controls, Voice settings) beyond what is necessary to place the new box above Call History."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}