{
  "kind": "build_request",
  "title": "Reorder controls, resize last-number display, rename draw button, and move Undo below board",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Move the “New Game” control to appear above the “Last Number” display in the main gameplay UI, while preserving the existing Yes/No confirmation behavior before starting a new game.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "New game on the top than last number box"
        ]
      },
      "acceptanceCriteria": [
        "In the main gameplay screen, a “New Game” button is rendered above the Last Number display card.",
        "Clicking “New Game” opens the existing confirmation dialog flow (Yes/No) and only starts a new game when “Yes” is confirmed.",
        "The previous “New Game” placement within the controls area is removed so the UI contains a single clear “New Game” entry point."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Reduce the visual size of the “Last Number” display box, including the card padding and the circular number display, while keeping it responsive and readable on mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "reduce the size of the box last number"
        ]
      },
      "acceptanceCriteria": [
        "The Last Number card uses smaller padding than the current design and occupies less vertical space in the left column.",
        "The circular last-number element (and its placeholder state) is smaller than before, with appropriately reduced font sizing to match.",
        "The component remains visually centered and does not overflow or clip at common mobile widths."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Rename the primary draw button label from “Draw Next” to “Draw Number” everywhere it appears in the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "rename draw next to draw number"
        ]
      },
      "acceptanceCriteria": [
        "The button previously labeled “Draw Next” is labeled “Draw Number”.",
        "No other user-facing text still shows “Draw Next”."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Reposition the “Undo” control so it appears after/below the Number Board area (i.e., rendered beneath the number grid), and remove the old “Undo” placement from the controls card.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and undo after the number board"
        ]
      },
      "acceptanceCriteria": [
        "An “Undo” button is displayed below the Number Board component on the gameplay screen.",
        "The Undo button keeps the same enabled/disabled behavior as before (disabled when undo is not allowed and/or when auto-draw is enabled).",
        "The Undo button no longer appears in the main controls card area."
      ]
    }
  ],
  "constraints": [
    "Frontend user-facing text must be in English.",
    "Do not modify files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "No changes to Tambola draw/undo/reset game logic beyond UI placement and labels.",
    "No backend (Motoko) changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}