{
  "kind": "build_request",
  "title": "Add Quick Reset button and confirmation popups for Reset/New Game actions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add a new \"Quick Reset\" control to the gameplay controls area alongside existing buttons.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Yes add quick reset button"
        ]
      },
      "acceptanceCriteria": [
        "Game controls UI includes a distinct button labeled \"Quick Reset\".",
        "The button is visible and usable on both mobile and desktop layouts without breaking the existing responsive layout."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Show a confirmation popup (Yes/No) whenever the user triggers either Quick Reset or New Game, and only proceed with the action when the user confirms \"Yes\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "but every time if some one click on reset or new game a popup should display do u want to reset yes/no or do you want to start new game yes/no"
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Quick Reset\" opens a modal/popup confirmation with English text asking: \"Do you want to reset?\" and buttons \"Yes\" and \"No\".",
        "Clicking \"New Game\" opens a modal/popup confirmation with English text asking: \"Do you want to start a new game?\" and buttons \"Yes\" and \"No\".",
        "Choosing \"No\" closes the popup and does not change the game state.",
        "Choosing \"Yes\" closes the popup and performs the requested action.",
        "The confirmation UI is implemented using existing frontend UI components (e.g., shadcn dialog/alert-dialog) without editing any files under frontend/src/components/ui."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Implement distinct handlers for Quick Reset vs New Game so that: (a) Quick Reset resets the game numbers state (called numbers, remaining pool, last drawn, completion) and stops auto-draw if running, while preserving the current auto-draw interval setting; (b) New Game performs a full reset including returning auto-draw settings (enabled + interval) to their defaults.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "reset or new game"
        ]
      },
      "acceptanceCriteria": [
        "After confirming \"Quick Reset\": the game returns to an initial numbers state (no called numbers, full pool, no last drawn, not complete).",
        "After confirming \"Quick Reset\": auto-draw is not running (auto-draw enabled is false), and the interval value displayed remains the same as before the reset.",
        "After confirming \"New Game\": the game returns to an initial numbers state and auto-draw settings return to the default values used on first load.",
        "After either action: persisted browser state reflects the updated state and remains consistent after a page refresh."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Backend must remain single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Adding new authentication flows or backend persistence.",
    "Changing the existing number drawing, undo logic, or board/history layout beyond adding the requested button and confirmation dialogs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}