{
  "kind": "build_request",
  "title": "Redeploy app using draft version 52 (rollback from drafts 53/54)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-2",
      "text": "Rebuild and deploy the application using the code exactly as it exists in draft version 52, discarding drafts 53 and 54 and making no functional or visual changes beyond selecting draft 52 for the live deployment.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent-13",
          "msg-recent-4"
        ],
        "quotes": [
          "Rebuilt/deployed using draft 52",
          "Discard 53, 54 draft version roll back to 52"
        ]
      },
      "acceptanceCriteria": [
        "The deployed/live app is built from draft 52 code (not draft 53 or 54).",
        "No intentional functional changes or UI/UX changes are introduced as part of this redeploy (beyond switching the deployed draft)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "After deploying draft 52, verify that the \"Voice Announcements\" toggle default state matches draft 52 behavior (it should be OFF on initial load, as observed in version 52), and ensure the deployed build reflects that draft-52 default without carrying over draft-54 behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-8"
        ],
        "quotes": [
          "No voice announcement toggle is off in version 52 but its on in version 54"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load (new browser session/incognito) of the deployed draft-52 build, the \"Voice Announcements\" switch renders OFF by default if that is how draft 52 behaved.",
        "The deployed build does not show the draft-54 default (ON) when running the draft-52 deployment."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the live release metadata to reflect that Draft 52 is now the live deployed version (update the constants in frontend/src/release/liveVersion.ts accordingly).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-13"
        ],
        "quotes": [
          "Rebuilt/deployed using draft 52"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/release/liveVersion.ts shows LIVE_VERSION as \"Draft 52\".",
        "LIVE_VERSION_DATE is updated to the deployment date in YYYY-MM-DD format."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only).",
    "Do not change backend architecture (single Motoko actor in backend/main.mo).",
    "Do not introduce new features or UX changes; the intent is to deploy draft 52 as-is."
  ],
  "nonGoals": [
    "Adding new Tambola gameplay features.",
    "Changing voice announcement functionality beyond ensuring the deployed build is truly draft 52 behavior.",
    "Adding or changing authentication flows."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}