{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rollback live deployment to Draft 52 (frontend verification + metadata update)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Ensure the live deployment uses Draft 52 code only, with no functional or UI/UX changes beyond selecting Draft 52 for deployment.",
      "acceptanceCriteria": [
        "The deployed/live app is built from draft 52 code (not draft 53 or 54).",
        "No intentional functional changes or UI/UX changes are introduced as part of this redeploy (beyond switching the deployed draft)."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Update deployment guidance/checklist to explicitly state that the live build must be produced from Draft 52 source, with verification steps to avoid deploying Draft 53/54 (documentation-only; no app behavior changes)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Restore Draft-52 default for the Voice Announcements toggle so it is OFF on fresh load and does not inherit Draft-54 default behavior.",
      "acceptanceCriteria": [
        "On a fresh load (new browser session/incognito) of the deployed draft-52 build, the \"Voice Announcements\" switch renders OFF by default if that is how draft 52 behaved.",
        "The deployed build does not show the draft-54 default (ON) when running the draft-52 deployment."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tambola/voice/voiceSettingsStorage.ts",
          "operation": "modify",
          "description": "Set the default voice settings to match Draft 52 behavior by defaulting voice announcements to disabled on initial load (ensure session-only defaults remain non-persistent)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update live release metadata constants to indicate Draft 52 is the currently deployed live version.",
      "acceptanceCriteria": [
        "frontend/src/release/liveVersion.ts shows LIVE_VERSION as \"Draft 52\".",
        "LIVE_VERSION_DATE is updated to the deployment date in YYYY-MM-DD format."
      ],
      "file_operations": [
        {
          "path": "frontend/src/release/liveVersion.ts",
          "operation": "modify",
          "description": "Update LIVE_VERSION to \"Draft 52\" and set LIVE_VERSION_DATE to the Draft-52 deployment date (YYYY-MM-DD)."
        }
      ]
    }
  ]
}