{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Tambola UI control layout tweaks (New Game position, smaller Last Number, rename Draw button, move Undo below board)",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Render a single “New Game” control above the Last Number display while preserving the existing Yes/No confirmation flow.",
      "acceptanceCriteria": [
        "In the main gameplay screen, a “New Game” button is rendered above the Last Number display card.",
        "Clicking “New Game” opens the existing confirmation dialog flow (Yes/No) and only starts a new game when “Yes” is confirmed.",
        "The previous “New Game” placement within the controls area is removed so the UI contains a single clear “New Game” entry point."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tambola/components/NewGameControl.tsx",
          "operation": "create",
          "description": "Create a dedicated NewGameControl component that renders the “New Game” button and the existing Yes/No confirmation dialog before calling the provided onNewGame callback. Use shadcn-ui components (Button, AlertDialog) to match existing UI patterns; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Reorder the left column so NewGameControl appears above LastNumberDisplay, and wire it to the existing newGame handler from useTambolaGame. Use shadcn-ui Button/AlertDialog via the NewGameControl component; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/tambola/components/GameControls.tsx",
          "operation": "modify",
          "description": "Remove the “New Game” button (and its dialog state/UI) from the controls card so there is only a single New Game entry point in the gameplay UI. Ensure any remaining dialogs (e.g., Quick Reset) continue working. Uses shadcn-ui components already imported; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Reduce the visual size of the Last Number display (card padding and circular number) while keeping it responsive and readable.",
      "acceptanceCriteria": [
        "The Last Number card uses smaller padding than the current design and occupies less vertical space in the left column.",
        "The circular last-number element (and its placeholder state) is smaller than before, with appropriately reduced font sizing to match.",
        "The component remains visually centered and does not overflow or clip at common mobile widths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tambola/components/LastNumberDisplay.tsx",
          "operation": "modify",
          "description": "Adjust Tailwind classes to reduce Card padding and downsize the circular display and typography (including placeholder state), using responsive sizing (e.g., smaller base sizes with slightly larger sm+ sizes) to maintain readability and avoid overflow on mobile. Uses shadcn-ui Card; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Rename the primary draw button label from “Draw Next” to “Draw Number” everywhere in the UI.",
      "acceptanceCriteria": [
        "The button previously labeled “Draw Next” is labeled “Draw Number”.",
        "No other user-facing text still shows “Draw Next”."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tambola/components/GameControls.tsx",
          "operation": "modify",
          "description": "Update the primary draw action button label text from “Draw Next” to “Draw Number” (and ensure no other UI text strings still contain “Draw Next”). Uses shadcn-ui Button; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Move the Undo control to render beneath the Number Board and remove it from the controls card while preserving enabled/disabled behavior.",
      "acceptanceCriteria": [
        "An “Undo” button is displayed below the Number Board component on the gameplay screen.",
        "The Undo button keeps the same enabled/disabled behavior as before (disabled when undo is not allowed and/or when auto-draw is enabled).",
        "The Undo button no longer appears in the main controls card area."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tambola/components/GameControls.tsx",
          "operation": "modify",
          "description": "Remove the Undo button from the controls card UI (do not change undo logic; only remove the control rendering). Uses shadcn-ui Button; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render an Undo button below the NumberBoard area and wire it to undoLastDraw, reusing existing canUndo and autoDrawEnabled state to preserve disabled behavior (disabled when undo is not allowed and/or when auto-draw is enabled). Use shadcn-ui Button (and optionally Card/layout primitives already in use) for consistent styling; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}