{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Verify Called Numbers: 15-box entry, browser-native voice autofill, and detailed failure results",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the single Verify Called Numbers text field with exactly 15 independently editable inputs (positions 1–15) and verify using the values from those inputs.",
      "acceptanceCriteria": [
        "The Verify section renders exactly 15 input boxes clearly labeled or visually grouped as positions 1–15.",
        "Each input accepts manual typing and can be edited independently.",
        "Verification uses the values from these 15 inputs (ignoring empty inputs) as the entered numbers.",
        "If no numbers are entered across all boxes, the UI shows an error message: “Please enter at least 1 number.”"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tambola/components/VerifyCalledNumbers.tsx",
          "operation": "modify",
          "description": "Refactor the Verify Called Numbers UI to render a 15-position input grid (positions 1–15) using composed shadcn-ui components (Input/Label/Card/Button/Alert) without editing files under frontend/src/components/ui. Store input values as a 15-length array, allow independent manual edits, and update verification to build the entered list from these boxes (trim/ignore empties, validate 1–90). Show the required empty-state error message when all 15 are empty. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/tambola/verify/parseEnteredNumbers.ts",
          "operation": "modify",
          "description": "Extend/adjust verification parsing utilities so Verify Called Numbers can convert the 15 input-box values into a cleaned list of valid integers (1–90), with deterministic ordering and deduping behavior that supports later “not called” reporting."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a browser-native voice recording/listening control that transcribes spoken numbers and auto-fills inputs 1–15 in order, while keeping manual typing as fallback.",
      "acceptanceCriteria": [
        "A “Record” control is available in the Verify section; starting recording begins listening and provides a clear in-progress UI state (e.g., “Listening…” and a Stop button).",
        "When recording is stopped (or recognition ends), the app transcribes the spoken audio to text using a browser-native approach (no external services).",
        "The transcription is parsed into integers and the first 15 valid numbers are placed into input boxes 1–15 in order.",
        "If more than 15 valid numbers are spoken, extras are ignored (no crash).",
        "If the browser does not support speech recognition or permission is denied, the UI shows a clear error message and manual entry continues to work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tambola/voice/useSpeechRecognition.ts",
          "operation": "create",
          "description": "Create a lightweight React hook that wraps browser-native SpeechRecognition (including webkitSpeechRecognition fallback) to provide: start/stop listening, interim/final transcript capture, and surfaced error states (unsupported, permission denied, other recognition errors)."
        },
        {
          "path": "frontend/src/features/tambola/verify/parseSpokenNumbers.ts",
          "operation": "create",
          "description": "Add a helper to parse a speech transcript into integers suitable for Verify Called Numbers: extract digit sequences, optionally normalize common spoken number words into digits (basic 1–90 coverage), return numbers in spoken order, and cap results to first 15 valid entries (1–90) while safely ignoring extras/invalids."
        },
        {
          "path": "frontend/src/features/tambola/components/VerifyCalledNumbers.tsx",
          "operation": "modify",
          "description": "Add a Record/Stop control and in-progress “Listening…” UI state to the Verify section. Use the new useSpeechRecognition hook to obtain transcript text via browser-native speech recognition, parse it with parseSpokenNumbers, and auto-fill input positions 1–15 in order (without disabling manual typing). Display clear errors when unsupported or permission denied, and ensure manual entry + Verify still work in these cases. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show detailed verification failures by listing exactly which entered numbers have not been called, while keeping the existing success message behavior (verified count).",
      "acceptanceCriteria": [
        "If any entered numbers are not present in the called numbers list, the error state lists them (e.g., “Not called: 12, 45”).",
        "The list of not-called numbers is unique and displayed in a stable, readable format.",
        "If all entered numbers have been called, the success message remains and reflects the verified count (e.g., “All 7 numbers have been called”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tambola/components/VerifyCalledNumbers.tsx",
          "operation": "modify",
          "description": "Update verification result handling to compute the set of entered numbers not present in calledNumbers, render an error message that lists them in a stable, readable format (unique values), and keep the success message reflecting the verified count when all are called. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}